def get_help_text():
    return (
        "🤖 *Этот бот помогает генерировать и проверять @username, проверенный на уникальность в telegram.*\n\n"
        
        "🛠 *Как можно использовать сгенерированный username?*\n"
        "• Личный аккаунт\n"
        "• Блог, канал, сообщество\n"
        "• Чат\-бот или сервис\n"
        "• Выставить на торги на Fragment?\n\n"
        
        "🎨 *Стили username:*\n"
        "• *epic* — мощные, звучные, внушительные username, которые вызывают ощущение силы и значимости\n"
        "• *strict* — строгие, лаконичные, солидные username, которые выглядят профессионально\n"
        "• *funky* — игривые, необычные, креативные username с элементами юмора\n"
        "• *minimal* — простые, элегантные, короткие username, которые выглядят стильно\n"
        "• *cringe* — абсурдные, нелепые, запоминающиеся username, которые могут выглядеть смешно или странно\n\n"
        "📩 *По вопросам:* @PanarinIgor"
    )
