def get_help_text():
    return (
        "🤖 *Этот бот помогает генерировать и проверять username.*\n\n"
        "📋 *Доступные команды:*\n"
        "/start — начать работу с ботом\n"
        "/generate — сгенерировать username\n"
        "/check — проверить доступность username\n"
        "/help — получить справку\n\n"
        "🛠 *Где можно использовать username?*\n"
        "Личный аккаунт.\n"
        "Блог, канал, сообщество.\n"
        "Чат-бот или сервис\n\n"
        "📩 *По вопросам:* @PanarinIgor"
    )