def get_help_text():
    return (
        "🤖 *Этот бот генерирует @username и сразу проверяет их на уникальность, а также позволяет проверить доступность любого username по вашему запросу.*\n\n"

        "🛠 *Как можно использовать сгенерированный username?*\n"
        "• Личный аккаунт\n"
        "• Блог, канал, сообщество, чат\n"
        "• Бот или сервис\n"
        "• Выставить на торги на Fragment?\n\n"

        "🎨 *Стили username:*\n"
        "• *epic* — мощные, звучные, внушительные username, которые вызывают ощущение силы и значимости\n"
        "• *strict* — строгие, лаконичные, солидные username, которые выглядят профессионально\n"
        "• *funky* — игривые, необычные, креативные username с элементами юмора\n"
        "• *minimal* — простые, элегантные, короткие username, которые выглядят стильно\n"
        "• *cringe* — абсурдные, нелепые, запоминающиеся username, которые могут выглядеть смешно или странно\n\n"

        "🔐 *Политика конфиденциальности*\n"

        "_Бот не запрашивает персональные данные пользователей\n"
        "_Персональные данные пользователей не собираются._\n"
        "[Политика конфиденциальности Telegram](https://telegram.org/privacy-tpa\\?ysclid\\=m7c9py9nrz241675708)\n\n"

        "📩 *По вопросам:* @PanarinIgor\n"
    )
